In [1]:
import pandas as pd

In [2]:
data= {
    'Name':['arz','khan','aftab'], 'Age':[20,22,25]}
df=pd.DataFrame(data)
print(data)

{'Name': ['arz', 'khan', 'aftab'], 'Age': [20, 22, 25]}

In [3]:
print(pd.__version__)

2.2.3

In [4]:
s= pd.Series([10,20,30,40],index=['a','b','c','d'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
data= {
    'Name':['arz','khan','aftab'], 'Age':[20,22,25],
    'Selary':[17000,20000,14000]}
df=pd.DataFrame(data)
print(data)

{'Name': ['arz', 'khan', 'aftab'], 'Age': [20, 22, 25], 'Selary': [17000, 20000, 14000]}

In [6]:
df['Age']

0    20
1    22
2    25
Name: Age, dtype: int64

In [7]:
df['Selary']

0    17000
1    20000
2    14000
Name: Selary, dtype: int64

In [8]:
df[['Name','Age']]

    Name  Age
0    arz   20
1   khan   22
2  aftab   25

In [9]:
df.loc[0]

Name        arz
Age          20
Selary    17000
Name: 0, dtype: object

In [14]:
df.loc[0:2]

    Name  Age  Selary
0    arz   20   17000
1   khan   22   20000
2  aftab   25   14000

In [15]:
df.loc[1,'Selary']

np.int64(20000)

In [31]:
df[df['Age']>=25]

    Name  Age  Selary
2  aftab   25   14000

In [18]:
#changing data type
df['Age']=df['Age'].astype(float)

In [19]:
#Removing duplicates
df.drop_duplicates(inplace=True)

In [25]:
grouped=df.groupby('AgeGroup')
 print(grouped['Income'].mean())

IndentationError: unexpected indent (2204840911.py, line 2)

In [28]:
data= {
    'Name':['arz','khan','aftab'], 'Age':[20,22,25],
    'Selary':[17000,20000,14000]}
df=pd.DataFrame(data)
df['Selary'].agg(['mean', 'max', 'min'])

mean    17000.0
max     20000.0
min     14000.0
Name: Selary, dtype: float64

In [32]:
df1 = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [100, 200, 300]
}, index=['x', 'y', 'z'])
print(df1)

    A    B
x  10  100
y  20  200
z  30  300

In [33]:
df1.head()

    A    B
x  10  100
y  20  200
z  30  300

In [34]:
df1.tail()

    A    B
x  10  100
y  20  200
z  30  300

In [35]:
df.shape

(3, 3)

In [36]:
df1.columns.tolist()

['A', 'B']

In [37]:
df1.columns.tolist()

['A', 'B']

In [38]:
df1.dtypes

A    int64
B    int64
dtype: object

In [39]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 180.0+ bytes

In [40]:
df1.describe()

          A      B
count   3.0    3.0
mean   20.0  200.0
std    10.0  100.0
min    10.0  100.0
25%    15.0  150.0
50%    20.0  200.0
75%    25.0  250.0
max    30.0  300.0

In [41]:
df1.sample(2)

    A    B
z  30  300
y  20  200

In [42]:
df1.to_string()

'    A    B\nx  10  100\ny  20  200\nz  30  300'

In [43]:
data['Age']

[20, 22, 25]

In [46]:
data['Selary']

[17000, 20000, 14000]

In [47]:
data

{'Name': ['arz', 'khan', 'aftab'],
 'Age': [20, 22, 25],
 'Selary': [17000, 20000, 14000]}

In [48]:
first_row = df1.iloc[0]
print(first_row)

A     10
B    100
Name: x, dtype: int64

In [49]:
rows_0_to_1 = df1.iloc[0:2]
print(rows_0_to_1)

    A    B
x  10  100
y  20  200

In [50]:
col_b = df1.iloc[:, 1] 
print(col_b)

x    100
y    200
z    300
Name: B, dtype: int64

In [51]:
missing_data = {
    'A': [1, 2, None, 4],
    'B': [None, 5, 6, 7],
    'C': [8, 9, 10, None]
}
missing_data = pd.DataFrame(missing_data)

In [52]:
missing_data = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 5, 6, 7],
    'C': [8, None, 10, None]
})
missing_data

     A    B     C
0  1.0  NaN   8.0
1  2.0  5.0   NaN
2  NaN  6.0  10.0
3  4.0  7.0   NaN

In [53]:
missing_data.isnull()

       A      B      C
0  False   True  False
1  False  False   True
2   True  False  False
3  False  False   True

In [54]:
missing_data.isnull().sum()

A    1
B    1
C    2
dtype: int64

In [55]:
df['Age']

0    20
1    22
2    25
Name: Age, dtype: int64

In [56]:
df['Age'] = df['Age'].astype(float)  # Convert Age to float
print(df.dtypes)

Name       object
Age       float64
Selary      int64
dtype: object

In [57]:
df['Age']

0    20.0
1    22.0
2    25.0
Name: Age, dtype: float64

In [58]:
df_with_duplicates = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie'], 
    'Age': [25, 30, 25, 35],
    'Salary': [50000, 60000, 50000, 70000]
}) 
print(df_with_duplicates)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2    Alice   25   50000
3  Charlie   35   70000

In [59]:
print(df_with_duplicates.duplicated())

0    False
1    False
2     True
3    False
dtype: bool

In [60]:
print(df_with_duplicates.drop_duplicates())

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
3  Charlie   35   70000

In [61]:
df

    Name   Age  Selary
0    arz  20.0   17000
1   khan  22.0   20000
2  aftab  25.0   14000

In [63]:
print(df['Selary'].sum())

51000

In [64]:
print(df['Age'].mean())

22.333333333333332

In [65]:
print(df['Selary'].count())

3

In [66]:
# minimum value in a column
print(df['Age'].min())

20.0

In [67]:
print(df['Selary'].max())

20000